{"title":"Combined feed","url":"https://ayanamist.github.io/feeds/all.xml","elements":[{"title":"Announcing Pulsar Virtual Summit Europe 2021: CFP Is Open! (StreamNative Blog)","contents":"Pulsar Summit is coming to Europe! Submit a talk today and share your Pulsar story. CFP is open till July 14th, 2021.","link":"https://streamnative.io/en/blog/community/2021-06-30-announcing-pulsar-virtual-summit-europe-2021-cfp-is-open","retrieved":1626284470426},{"title":"Pulsar Hackathon 2021 Winners Announced (StreamNative Blog)","contents":"Read about the winning projects of the Pulsar Hackathon 2021 and the StreamNative Incubator program.","link":"https://streamnative.io/en/blog/community/2021-06-22-pulsar-hackathon-2021-winners-announced","retrieved":1626284470431},{"title":"Highlights from The Pulsar Virtual Summit North America 2021 (StreamNative Blog)","contents":"The Pulsar Virtual Summit North America 2021 was packed with Pulsar project updates, ecosystem news, and insights into some of the largest and most exciting Pulsar deployments around the globe. This blog shares the highlights of the event.","link":"https://streamnative.io/en/blog/community/2021-06-22-highlights-from-the-pulsar-virtual-summit-north-america-2021","retrieved":1626284470433},{"title":"Introducing StreamNative Platform (StreamNative Blog)","contents":"We are excited to announce StreamNative Platform 1.0, a cloud-native, unified messaging and streaming platform powered by Apache Pulsar. StreamNative Platform provides a complete, declarative API-driven experience for deploying and self-managing Apache Pulsar in your private environments. With StreamNative Platform, we’ve packaged our enterprise expertise with StreamNative Cloud to help you build your own private cloud Pulsar service.","link":"https://streamnative.io/en/blog/release/2021-06-16-streamnative-platform","retrieved":1626284470441},{"title":"A Deep-dive of Transactions in Apache Pulsar (StreamNative Blog)","contents":"Previously, we introduced the exactly-once semantics enabled by Transaction API for Pulsar. In this blog, we dive deeper into the transactions in Pulsar and familiarize you with the main concepts needed to use the Pulsar Transaction API effectively.","link":"https://streamnative.io/en/blog/tech/2021-06-16-a-deep-dive-of-transactions-in-apache-pulsar","retrieved":1626284470460},{"title":"Apache Pulsar Launches 2.8: Unified Messaging and Streaming With Transactions (StreamNative Blog)","contents":"This blog provides a deep dive into the updates from the 2.8.0 release as well as a detailed look at the major Pulsar developments that have helped it evolve into the unified messaging and streaming platform it is today.","link":"https://streamnative.io/en/blog/release/2021-06-15-apache-pulsar-launches-2-8-unified-messaging-and-streaming-with-transactions","retrieved":1626284470462},{"title":"Pulsar Hits Its 400th Contributor & Passes Kafka in Monthly Active Contributors (StreamNative Blog)","contents":"Pulsar is growing faster than ever. Read about key Pulsar milestones and ecosystem development across the project.","link":"https://streamnative.io/en/blog/community/2021-06-14-pulsar-hits-its-400th-contributor-and-passes-kafka-in-monthly-active-contributors","retrieved":1626284470473},{"title":"Exactly-Once Semantics with Transactions in Pulsar (StreamNative Blog)","contents":"As part of the 2.8 Pulsar release, we have evolved the exactly-once semantic from guaranteed message deduplication on a single topic to atomic produce and acknowledgement over multiple topics via Transaction API.","link":"https://streamnative.io/en/blog/release/2021-06-14-exactly-once-semantics-with-transactions-in-pulsar","retrieved":1626284470475},{"title":"Pulsar User Survey 2021 Highlights (StreamNative Blog)","contents":"In this report, we look at the key takeaways from the 2021 Apache Pulsar User Report and the major trends driving change across the messaging and streaming landscape.","link":"https://streamnative.io/en/blog/community/2021-06-11-pulsar-user-survey-2021-highlights","retrieved":1626284470477},{"title":"2021 Apache Pulsar User Report Announcement (StreamNative Blog)","contents":"We’re excited to announce the 2021 Apache Pulsar User Report is now available. Read about the growth in adoption and engagement across the Apache Pulsar project!","link":"https://streamnative.io/en/blog/community/2021-06-10-2021-apache-pulsar-user-report-announcement","retrieved":1626284470480}]}